package com.best.bible.data;

public enum TitleData {
    창세기(1, "창세기"),
    출애굽기(2, "출애굽기"),
    레위기(3, "레위기"),
    민수기(4,"민수기"),
    신명기(5,"신명기"),
    여호수아(6,"여호수아"),
    사사기(7,"사사기"),
    룻기(8,"룻기"),
    사무엘상(9,"사무엘상"),
    사무엘하(10,"사무엘하"),
    열왕기상(11,"열왕기상"),
    열왕기하(12,"열왕기하"),
    역대상(13,"역대상"),
    역대하(14,"역대하"),
    에스라(15,"에스라"),
    느헤미야(16,"느헤미야"),
    에스더(17,"에스더"),
    욥기(18,"욥기"),
    시편(19,"시편"),
    잠언(20,"잠언"),
    전도서(21,"전도서"),
    아가(22,"아가"),
    이사야(23,"이사야"),
    예레미야(24,"예레미야"),
    예레미야애가(25,"예레미야애가"),
    에스겔(26,"에스겔"),
    다니엘(27,"다니엘"),
    호세아(28,"호세아"),
    요엘(29,"요엘"),
    아모스(30,"아모스"),
    오바댜(31,"오바댜"),
    요나(32,"요나"),
    미가(33,"미가"),
    나훔(34,"나훔"),
    하박국(35,"하박국"),
    스바냐(36,"스바냐"),
    학개(37,"학개"),
    스가랴(38,"스가랴"),
    말라기(39,"말라기"),
    마태복음(40,"마태복음"),
    마가복음(41,"마가복음"),
    누가복음(42,"누가복음"),
    요한복음(43,"요한복음"),
    사도행전(44,"사도행전"),
    로마서(45,"로마서"),
    고린도전서(46,"고린도전서"),
    고린도후서(47,"고린도후서"),
    갈라디아서(48,"갈라디아서"),
    에베소서(49,"에베소서"),
    빌립보서(50,"빌립보서"),
    골로새서(51,"골로새서"),
    데살로니가전서(52,"데살로니가전서"),
    데살로니가후서(53,"데살로니가후서"),
    디모데전서(54,"디모데전서"),
    디모데후서(55,"디모데후서"),
    디도서(56,"디도서"),
    빌레몬서(57,"빌레몬서"),
    히브리서(58,"히브리서"),
    야고보서(59,"야고보서"),
    베드로전서(60,"베드로전서"),
    베드로후서(61,"베드로후서"),
    요한1서(62,"요한1서"),
    요한2서(63,"요한2서"),
    요한3서(64,"요한3서"),
    유다서(65,"유다서"),
    요한계시록(66, "요한계시록");

    private final int number;
    private final String name;

    TitleData(int number, String name) {
        this.number = number;
        this.name = name;
    }

    public int getNumber() {
        return number;
    }

    public String getName() {
        return name;
    }
}
